# Hierarchical Indexing/ Columns
> **Hierachical indexing**: Country > State > City > Street     
> Multilevel indexing can be applied to both **index** (row) and **columns** (column).  
> 3 ways to generate double level indices:  
```python
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])```
```python
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])```
```python
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])```
All convert to:
```
MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])
           ```
> **df.reindex(new_index)** updates to new index.  
> **df.unstack()** makes it a 2-way table.  
> Assign names to index by **pop.index.names**.

## Hierachical Indexing

In [2]:
import pandas as pd
import numpy as np

### Pandas Series

In [3]:
# 2 indices (state,year) for 1 single value!
# Index is in a list with tuple elements
index = [('California', 2000), 
         ('California', 2010),
         ('New York', 2000), 
         ('New York', 2010),
         ('Texas', 2000), 
         ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
index = pd.MultiIndex.from_tuples(index)

print(index)
print('-----------------')
print(index.levels)
print('-----------------')
print(index.codes)

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )
-----------------
[['California', 'New York', 'Texas'], [2000, 2010]]
-----------------
[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]]

In [5]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [6]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [7]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [8]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### Pandas DataFrame

In [9]:
# pop has been indexed already

pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [10]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [11]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.277984  0.638735
  2  0.566017  0.624123
b 1  0.610992  0.861593
  2  0.785193  0.932583

### From Dictionary to Series
> **keys** contains (index1, index2).

In [12]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [13]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [14]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [15]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

### Naming indices

In [16]:
print('Original data \n',pop)
print('----------------')
pop.index.names = ['state', 'year']
print('Indexed data \n',pop)

Original data
 California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64
----------------
Indexed data
 state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [17]:
# Hierarchical indices and columns

index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], 
                                      ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [18]:
# Mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

In [19]:
# Create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      48.0  37.5  35.0  36.9  21.0  38.0
     2      51.0  37.4  50.0  36.9  27.0  36.9
2014 1      35.0  38.0  34.0  35.7  44.0  36.3
     2      48.0  35.5  34.0  36.9  50.0  37.4

## Slicing and Subsetting based on Conditions
> Explicit (**loc**) and implicit (**iloc**) still apply.  
> **sort_index()** reorders the index alphatically or numerically.

In [20]:
health_data.iloc[:2, :2] # IMPLICIT

subject      Bob
type          HR  Temp
year visit
2013 1      48.0  37.5
     2      51.0  37.4

In [21]:
health_data['Guido'] # EXPLICIT

type          HR  Temp
year visit
2013 1      35.0  36.9
     2      50.0  36.9
2014 1      34.0  35.7
     2      34.0  36.9

In [22]:
health_data.loc[:, ('Bob', 'HR')] # EXPLICIT

year  visit
2013  1        48.0
      2        51.0
2014  1        35.0
      2        48.0
Name: (Bob, HR), dtype: float64

In [23]:
health_data.loc[(2013,1), ('Bob', 'HR')] # EXPLICIT

48.0

In [24]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']] # EXPLICIT

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      48.0  35.0  21.0
2014 1      35.0  34.0  44.0

In [25]:
health_data.loc[idx[2013, 1], idx['Bob', 'HR']] # EXPLICIT

48.0

### Sorting by Index

In [26]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.175977
      2      0.049244
c     1      0.054107
      2      0.417608
b     1      0.575904
      2      0.194775
dtype: float64

In [27]:
data = data.sort_index()
data

char  int
a     1      0.175977
      2      0.049244
b     1      0.575904
      2      0.194775
c     1      0.054107
      2      0.417608
dtype: float64

In [28]:
data['a':'b']

char  int
a     1      0.175977
      2      0.049244
b     1      0.575904
      2      0.194775
dtype: float64

### Changing Shapes of DataFrame
> **unstack(level=0)** chooses level[0] (state) as column and level[1] (year) as row.  
> **unstack(level=1)** chooses level[1] (year) as column and level[0] (state) as row.   
> **reset_index(name='new_var')** treats **index** and the **values** are all variables.   
> **set_index(name='new_var')** reverses the above action.

## Stacking and Unstacking Again

In [29]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [30]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [31]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [32]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [33]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Aggregation and Grouping on Multi-Index

In [34]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      48.0  37.5  35.0  36.9  21.0  38.0
     2      51.0  37.4  50.0  36.9  27.0  36.9
2014 1      35.0  38.0  34.0  35.7  44.0  36.3
     2      48.0  35.5  34.0  36.9  50.0  37.4

In [35]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     49.5  37.45  42.5  36.9  24.0  37.45
2014     41.5  36.75  34.0  36.3  47.0  36.85

In [36]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  38.666667  37.266667
2014  40.833333  36.633333

## Activity 1
> Generate a data ```df``` with index ```year``` and ```season```.  
> For ```year```, there are ```2010``` and ```2014```.  
> For ```season```, there are ```summer``` and ```winter```.  
> **columns** are ```asia``` and ```europe```.  
> Under ```asia``` and ```europe```, we have 2 columns ```East``` and ```West```.

In [37]:
ind   = pd.MultiIndex.from_product([[2010, 2014], ['summer', 'winter']])
col   = pd.MultiIndex.from_product([['asia', 'europe'], ['East', 'West']],
                                     names=['Area', 'Region'])
df = pd.DataFrame(np.random.randint(low=0,high=10,size=(4,4)),index=ind,columns=col)
df.index.names = ['year', 'season']
df

Area        asia      europe
Region      East West   East West
year season
2010 summer    2    2      4    0
     winter    8    0      2    2
2014 summer    1    1      5    0
     winter    3    9      4    9

## Activity 2
> 1. Calculate the mean by region.  
> 2. Calculate the mean of ```df``` at the level of year for every region. 
> 3. Calculate the mean by area and year.

In [38]:
df.mean(axis=0)

Area    Region
asia    East      3.50
        West      3.00
europe  East      3.75
        West      2.75
dtype: float64

In [39]:
df_mean = df.mean(level='year')
df_mean

Area   asia      europe
Region East West   East West
year
2010    5.0  1.0    3.0  1.0
2014    2.0  5.0    4.5  4.5

In [40]:
df_mean.mean(axis=1,level='Area')

Area  asia  europe
year
2010   3.0     2.0
2014   3.5     4.5